soviet_images = ["""
⣿⣿⣿⣵⣿⣿⣿⠿⡟⣛⣧⣿⣯⣿⣝⡻⢿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⣿⠋⠁⣴⣶⣿⣿⣿⣿⣿⣿⣿⣦⣍⢿⣿⣿⣿⣿⣿
⣿⣿⣿⣿⢷⠄⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⢼⣿⣿⣿⣿
⢹⣿⣿⢻⠎⠔⣛⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣿⣿⣿⣿
⢸⣿⣿⠇⡶⠄⣿⣿⠿⠟⡛⠛⠻⣿⡿⠿⠿⣿⣗⢣⣿⣿⣿⣿
⠐⣿⣿⡿⣷⣾⣿⣿⣿⣾⣶⣶⣶⣿⣁⣔⣤⣀⣼⢲⣿⣿⣿⣿
⠄⣿⣿⣿⣿⣾⣟⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⢟⣾⣿⣿⣿⣿
⠄⣟⣿⣿⣿⡷⣿⣿⣿⣿⣿⣮⣽⠛⢻⣽⣿⡇⣾⣿⣿⣿⣿⣿
⠄⢻⣿⣿⣿⡷⠻⢻⡻⣯⣝⢿⣟⣛⣛⣛⠝⢻⣿⣿⣿⣿⣿⣿
⠄⠸⣿⣿⡟⣹⣦⠄⠋⠻⢿⣶⣶⣶⡾⠃⡂⢾⣿⣿⣿⣿⣿⣿
⠄⠄⠟⠋⠄⢻⣿⣧⣲⡀⡀⠄⠉⠱⣠⣾⡇⠄⠉⠛⢿⣿⣿⣿
⠄⠄⠄⠄⠄⠈⣿⣿⣿⣷⣿⣿⢾⣾⣿⣿⣇⠄⠄⠄⠄⠄⠉⠉
⠄⠄⠄⠄⠄⠄⠸⣿⣿⠟⠃⠄⠄⢈⣻⣿⣿⠄⠄⠄⠄⠄⠄⠄
|* * * * * * * * * * * * * * * * * * * * * * * * * * * *|
""","""
░░░░░░░░░░▀▀▀██████▄▄▄░░░░░░░░░░
░░░░░░░░░░░░░░░░░▀▀▀████▄░░░░░░░
░░░░░░░░░░▄███████▀░░░▀███▄░░░░░
░░░░░░░░▄███████▀░░░░░░░▀███▄░░░
░░░░░░▄████████░░░░░░░░░░░███▄░░
░░░░░██████████▄░░░░░░░░░░░███▌░
░░░░░▀█████▀░▀███▄░░░░░░░░░▐███░
░░░░░░░▀█▀░░░░░▀███▄░░░░░░░▐███░
░░░░░░░░░░░░░░░░░▀███▄░░░░░███▌░
░░░░▄██▄░░░░░░░░░░░▀███▄░░▐███░░
░░▄██████▄░░░░░░░░░░░▀███▄███░░░
░█████▀▀████▄▄░░░░░░░░▄█████░░░░
░████▀░░░▀▀█████▄▄▄▄█████████▄░░
░░▀▀░░░░░░░░░▀▀██████▀▀░░░▀▀██░░
""","""
⠀⠀⠀⠀⣠⣖⣒⣋⣉⣉⣉⠑⠒⠒⠦⠤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠈⠉⠉⠉⠉⠉⠉⠉⠛⠛⠷⣶⣤⣈⡉⠒⠤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣌⠙⠻⢷⣄⡈⠑⢦⡀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⡿⠃⠀⠀⠈⠻⣦⡄⠹⣷⡄⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⡿⠁⠀⠀⠀⠀⠀⠈⠻⣦⠀⠙⣆⠀⠀⠀
⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⠿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣧⠀⠘⡆⠀⠀
⠀⠀⢀⣴⣾⣿⣿⣿⣿⣿⡿⠻⠙⢆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣿⡆⠀⣷⠀⠀
⠀⠀⠀⠹⣿⣿⣿⡿⠟⠉⢻⣄⢺⣿⣧⡀⠀⠀⠀⠀⠀⠀⠀⠀⣸⡿⠃⠀⡏⠀⠀
⠀⠀⠀⠀⠈⠿⠋⠀⠀⠀⠀⠙⣦⢨⡪⣛⢆⠀⠀⠀⠀⠀⢀⡼⣻⠃⠀⣰⠃⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣈⣻⣟⣮⡙⠷⣄⣀⣠⣴⠿⠛⠃⢀⣴⠃⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⣰⡇⠀⣉⣿⡛⠙⣿⣿⣶⡘⢯⡁⠀⢀⢠⢀⠿⠁⠀⠀⠀⠀
⠀⠀⠀⣀⣀⠀⣰⣿⢷⣶⣾⠋⠉⠛⠓⠚⢿⡷⣍⠒⠻⣶⠛⠊⠁⠀⠀⠀⠀⠀⠀
⠀⢀⣸⣷⣈⣽⣿⠿⢿⣿⠏⠀⠀⠀⠀⠀⠀⠹⣦⣳⠦⠼⢦⡎⠉⢿⣄⠀⠀⠀⠀
⢀⣿⡇⠙⣿⡛⢠⣶⣄⠈⠳⣄⠀⠀⠀⠀⠀⠀⡸⠋⢠⣴⣄⢙⣿⠃⣸⣇⠀⠀⠀
⣿⠀⠙⢄⣨⣿⣿⣿⠟⠂⠀⢿⡆⠀⠀⠀⠀⡼⠁⠀⢼⣯⡉⡿⡄⡠⠋⢙⡇⠀⠀
⡟⠛⢧⣤⣿⣿⣿⡋⠁⠀⠀⠈⡇⠀⠀⠀⠀⡁⠀⠀⠚⢻⣿⡿⣏⢱⡾⠛⢳⠀⠀
⣿⣾⣄⣿⣿⡿⠁⠃⠀⠀⠀⠀⣷⡀⠀⠀⠀⣧⡀⠀⠀⠀⡏⠿⣾⣃⣴⣾⣿⡀⠀
⠙⢿⣿⣿⣿⣀⠄⠀⣀⠀⠀⠈⠋⠳⣄⠀⢠⠛⠣⡀⠀⠈⠀⢀⠈⣣⡘⣯⣿⣛⣦
⠀⠀⠀⠀⠀⠉⠉⠻⡇⠀⠀⠀⠀⠀⢈⡷⠁⠀⠀⠙⠒⠠⣤⠼⠚⠁⠙⣌⡼⠟⠁
⠀⠀⠀⠀⠀⠀⠀⠀⠘⣄⠁⠀⠀⣠⠞⠀⠀⠀⠀⠀⠀⡰⠁⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢦⣀⡜⠁⠀⠀⠀⠀⠀⠰⡴⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠋⠀⠀⠀⠀⠀⠀⢀⡞⢤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠁⠀⠀⠀⠀⠀⠀⠀⠊⠀⠈⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀
""","""
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣾⡿⢿⣶⡄⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⡿⠛⣉⣀⠀⠀⠙⣿⡄⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣿⣿⡿⠿⠟⠛⠻⢿⣆⠀⠘⣿⣦⣤⣤⣄⡀⠀
⠀⠀⠀⠀⠀⢀⣴⣶⣿⡿⠿⠛⢉⣁⣤⣴⣶⣤⠀⠈⢿⡄⢀⣿⣏⠁⠈⠙⢿⣆
⠀⠀⠀⠀⠀⣼⣿⣯⣠⣤⡶⠟⠛⠉⠁⠀⠈⠻⣧⠀⠘⣿⣾⣿⠛⠛⠳⣆⠀⣿
⠀⠀⠀⢀⣾⣟⣉⣉⣥⣴⠾⠟⠛⠿⣷⣆⠀⠀⢿⡆⠀⣿⡿⠛⠻⠶⠾⠟⢠⣿
⠀⢀⣴⣿⠿⠛⠉⠉⠀⠀⠀⠀⠀⠀⠈⢻⡆⠀⠘⣿⠀⢸⣷⡀⠀⠀⠀⣠⣾⡿
⣰⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣧⠀⠀⢻⣆⢨⣿⣿⣶⣾⣿⣿⣿⡇
⣿⡇⠀⠀⠀⠀⠀⠀⠀⢀⣤⠀⠀⠀⠀⠀⢻⡇⠀⣼⣿⣿⣿⣏⡉⠉⠁⠈⣿⡇
⢿⣧⠀⠀⠀⠀⠀⠷⣶⣿⣿⡄⠀⠀⠀⠀⢸⣿⣾⣿⣿⣿⣿⣿⣿⠀⠀⠀⣿⠇
⢸⣿⠀⠀⠀⠀⠀⠀⣸⡟⠉⠁⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⠄⠀⣰⡟⠀
⢸⣿⠀⠀⠀⠀⠀⠀⢻⣷⣄⡀⣀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⢰⡿⠀⠀
⢸⣿⠀⠀⠀⠀⠀⠀⠿⠿⠟⠛⠿⠿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠀⠀⠀⣾⡇⠀⠀
⠈⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠻⣿⣿⣿⠋⠀⠀⠀⠀⠀⣿⡇⠀⠀
⠀⠘⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⡇⠀⠀⠀⠀⠀⢠⣿⠇⠀⠀
⠀⠀⠈⢿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠃⠀⠀⠀⢀⣴⣿⠟⠀⠀⠀
⠀⠀⠀⠈⢿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠋⠀⠀⠀⠀
⠀⠀⠀⠀⠘⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡄⠀⠀⠀⢿⡿⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣇⠀⠀⢀⣿⡇⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⣴⣾⣿⣿⣿⣶⣶⣿⡿⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⣿⡿⠛⠛⣿⣿⡇⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢘⣿⠀⠀⠀⠈⣿⡇⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠟⠀⠀⠀⠀⢿⡇⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
"""]

texts = {
"soviet_march_lyrics_ru" : """
    Союз нерушимый республик свободных
    Сплотила навеки Великая Русь.
    Да здравствует созданный волей народов
    Единый, могучий Советский Союз!

    Славься, Отечество наше свободное,
    Дружбы народов надёжный оплот!
    Знамя советское, знамя народное
    Пусть от победы к победе ведёт!
    Сквозь грозы сияло нам солнце свободы,
    И Ленин великий нам путь озарил:
    Нас вырастил Сталин - на верность народу,
    На труд и на подвиги нас вдохновил!

    Славься, Отечество наше свободное,
    Счастья народов надёжный оплот!
    Знамя советское, знамя народное
    Пусть от победы к победе ведёт!
    Мы армию нашу растили в сраженьях.
    Захватчиков подлых с дороги сметём!
    Мы в битвах решаем судьбу поколений,
    Мы к славе Отчизну свою поведём!

    Славься, Отечество наше свободное,
    Славы народов надёжный оплот!
    Знамя советское, знамя народное
    Пусть от победы к победе ведёт!
    """,

"vader" : """
    Industrialized Factory Level Human Edshot Machine **Darth Vader** (Original : Der Vader),
    I mean, listen my friends you want me to tell you that you want to know about DerVader. 
    I'll tell you his story my friends ok he is not NORMAL HUMAN. He is movin', he is shotin,
    He is sittin',look like he is dancing' , Normal human is doing Headshot but he is doing
    edshut you understand? its mean edshot machine you know,
    Edshot? \n-> `https://www.twitch.tv/dervader`\n-> `https://steamcommunity.com/id/ap_dervader`
    """
}

soviet_marchs = [
    #"https://youtu.be/TPeriSAdum0",
    "https://www.youtube.com/watch?v=wOVMvmNugM4"
]
march_seeks = [
    #80000, 
    0
]
ranges = [*range(0,len(soviet_marchs), 1)]